{"pageProps":{"content":"<p>In these Terms, \"our\", \"we\" and \"us\" means Total Rehab App Ltd.</p><p>Please read these App Subscription Terms (the Terms) carefully. These Terms tell you how we will provide our app subscription service to you, how you and we may change or end the app subscription contract, what to do if there is a problem and other important information. We may amend these Terms at any time to ensure that we remain compliant with relevant laws and regulations. Please check these Terms regularly for any changes. If we make any important changes to the Terms we will notify you by email.</p><h3>Accessing our App</h3><p>Access to the Total Rehab App (the App) is permitted to subscribers during their App subscription period. We reserve the right to suspend, withdraw, discontinue or change all or any part or content of our App without notice. If we withdraw or discontinue subscriptions or the App, we will re-pay you a pro-rata refund of your subscription fees.</p><p>We will not be liable to you if for any reason our App is unavailable at any time or for any period. The App may have a limited amount of free content.</p><h3>Our contract with you</h3><h4>How you can sign up to our App subscription service.</h4><p>To access unlimited content on the App you will need to buy our App subscription through Google Play or the Apple App Store. You must be 18 years old or older, have the power to enter into a contract with us, and not be prevented from doing so under any local laws.</p><h4>Where to find the price for your App subscription.</h4><p>The price of the App subscription is indicated in Google Play or the Apple App Store. The price may vary from time to time or by country. We may withdraw any special offers at any time.</p><h4>When you must pay and how you must pay.</h4><p>You must pay for your App subscription via Google Play or the Apple App Store before you can access the App content.</p><p>Renewal Payments: Your app store will debit your debit/credit card at the beginning of your subscription (after the expiry of any free trial) and at the agreed frequency thereafter (unless you have cancelled - see \"Ending Your Subscription\" below).</p><h4>Your App Subscription will automatically renew.</h4><p>At the end of your initial App subscription period, your subscription will automatically renew on a rolling basis for the same period of time as your initial subscription, unless you give your app store notice that you would like to cancel via your account settings (see \"Ending Your Subscription\" below). We reserve the right to change the App subscription price and/or benefits at any time, and the changes will apply when your app subscription renews. If you object to these changes, you may terminate your App subscription within the 30 day period following the renewal.</p><h3>Your App subscription</h3><h4>Free Trial and Introductory Offers</h4><p>If you choose to become a subscriber through a trial offer or introductory offer, your trial or introductory offer will cost you the price advertised. Trial or introductory offers are limited to one per customer. At the end of your stated trial or introductory period, your App subscription will automatically continue on a rolling monthly or annual basis (as selected by you when you register) at the rate notified. You may cancel at any time during the free trial or introductory period via your app subscriptions account settings. If you cancel, your access to the App will stop at the end of the trial or introductory period.</p><h4>Access to content</h4><p>Once you have signed up for an App subscription you will immediately be able to access the App content until your App subscription expires or is otherwise terminated by you or us as set out in these Terms.  All content on the is provided in English. Content may only be downloaded or used for personal use.</p><h4>Length of App subscription</h4><p>Your App subscription will start immediately upon payment. Your minimum App subscription period and any renewal period will vary depending on the subscription chosen.  We may suspend your App access if you breach (or we suspect you have breached) these Terms.</p><h4>Ending your subscription</h4><p>To end your App subscription, please access your subscription account settings via your mobile device.  If you cancel within fourteen (14) days of the first payment at the start of your subscription (or any subsequent annual renewal), your app store will refund you in full.  In all other cases, your subscription will continue until your current App subscription term ends and you will not be refunded pro-rata if you cancel before the end of your term. This does not affect your statutory rights.</p><h4>Offers and promotions</h4><p>Offers and prices will vary from time to time and by country.  Promotional offers and incentives are subject to availability and may be changed at any time, subject to applicable laws. Some offers are only available to new customers and subscribers.</p><h3>Contacting customer services</h3><p>Please email support@total-rehab.co.uk for support.</p>"},"__N_SSG":true}