{"pageProps":{"content":"<p>In these Terms, \"our\", \"we\", \"us\", and \"Total Rehab\" means Total Rehab App Ltd.</p><h3>Agreement to terms</h3><p>The Total Rehab App is licensed to You (End-User) by Total Rehab App Ltd. \"Total Rehab\", located at 20 Winter Close, Epsom, London, KT17 1AH for use only under terms of this license agreement.</p><p>By downloading the Application from the Apple AppStore or the Google PlayStore, and any update thereto, You indicate that You agree to be bound by all of the terms and conditions of this license agreement.</p><p>All rights not expressly granted to You are reserved.</p><h3>Services provided by Total Rehab</h3><p>Total Rehab provides a mobile app that helps You recover from common lower-limb sports injuries. It does so by providing access to conservative exercise-based rehabilitation plans as well as curated tips &amp; information on how to manage the symptoms of the injury.</p><p>Based on the selected rehabilitation plan, You will get access to a structured plan of training sessions including videos and detailed written instructions of each exercise to perform. The App will offer you to increase or reduce the intensity of the training sessions based on Your feedback about perceived effort and whether you experienced any pain.</p><h3>When to use the app and when not</h3><p>The Total Rehab App is intended to support the recovery using exercise training from the following common musculoskeletal sports injuries and post-operation surgery:</p><p>- Ankle and Foot Strains and Sprains</p><p>- Musculoskeletal Shoulder Pathologies</p><p>- Hamstring Strains</p><p>- Musculoskeletal Lower Back Pathologies</p><p>- Total Knee Replacement Surgery</p><p>- Total Hip Replacement Surgery</p><p>- ACL Rupture Surgery</p><p>It should only be used if You have been diagnosed with such a condition by a medical professional. If You are not certain that you have one of the mentioned conditions, please consult a medical professional first before you start using the App.</p><p>Total Rehab App does not replace the diagnosis or treatment by a medical professional. If you have suffered a blunt trauma, experience acute pain or your symptoms worsen please seek medical help immediately.</p><h3>Scope of license</h3><p>You are given a revocable, non-exclusive, non-transferable, non-sublicensable limited right to install and use the mobile application on wireless electronic devices owned or controlled by you, and to access and use the mobile application on such devices strictly in accordance with the terms and conditions of this mobile application license contained in these Terms of Use.</p><p>You shall not:</p><p>decompile, reverse engineer, disassemble, attempt to derive the source code of, or decrypt the application;</p><p>make any modification, adaptation, improvement, enhancement, translation, or derivative work from the application;</p><p>violate any applicable laws, rules, or regulations in connection with your access or use of the application;</p><p>remove, alter, or obscure any proprietary notice (including any notice of copyright or trademark) posted by us or the licensors of the application;</p><p>use the application for any revenue generating endeavor, commercial enterprise, or other purpose for which it is not designed or intended;</p><p>make the application available over a network or other environment permitting access or use by multiple devices or users at the same time;</p><p>use the application for creating a product, service, or software that is, directly or indirectly, competitive with or in any way a substitute for the application;</p><p>use the application to send automated queries to any website or to send any unsolicited commercial e-mail; or</p><p>use any proprietary information or any of our interfaces or our other intellectual property in the design, development, manufacture, licensing, or distribution of any applications, accessories, or devices for use with the application.</p><p>The license granted to You for our App is limited to a non-transferable license to use the application on a device that utilizes the Apple iOS or Android operating systems, as applicable, and in accordance with the usage rules set forth in the applicable App Distributor’s terms of service;</p><p>we are responsible for providing any maintenance and support services with respect to the mobile application as specified in the terms and conditions of this mobile application license contained in these Terms of Use or as otherwise required under applicable law, and you acknowledge that each App Distributor has no obligation whatsoever to furnish any maintenance and support services with respect to the mobile application;</p><p>you acknowledge and agree that the App Distributors are third-party beneficiaries of the terms and conditions in this mobile application license contained in these Terms of Use, and that each App Distributor will have the right (and will be deemed to have accepted the right) to enforce the terms and conditions in this mobile application license contained in these Terms of Use against you as a third-party beneficiary thereof.</p><p>Violations of the obligations mentioned above, as well as the attempt of such infringement, may be subject to persecution and damages.</p><p>The company reserves the right to modify the terms and conditions of this licensing agreement.</p><h3>Data privacy</h3><p>You acknowledge that we collect, store, process and use any information and personal data generated by the use of our services in accordance with our privacy policy: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.total-rehab.co.uk/policies/privacy\">https://www.total-rehab.co.uk/policies/privacy</a></p><h3>Intellectual Property Rights &amp; Licenses</h3><p>Services offered to you, through our Website, mobile application and all other features, functionality, tools and Content are the sole property of Total Rehab. The user is granted non-exclusive, limited and revocable right to these services, for personal purposes only, pertaining that they comply with the Terms &amp; Conditions set forth in this Agreement.</p><p>All materials made available to users through the services may only be used in accordance with terms set forth in this agreement and for personal use, not commercial. No other use is authorized without express consent of Total Rehab.</p><p>Without limiting the foregoing, you agree that the trade names, logos and any other trademarks and services associated with Total Rehab are the property of Total Rehab. You are given a revocable, non-exclusive, non-transferable, non-sublicensable limited right to install and use the mobile application on wireless electronic devices owned or controlled by you, and to access and use the mobile application on such devices strictly in accordance with the terms and conditions of this mobile application license contained in these Terms &amp; Conditions.</p><p>You may not use, copy, reproduce, distribute, license, sell, transfer, publish, post, publicly display, publicly perform, transmit, broadcast, adapt, modify, prepare derivative works based upon, or otherwise exploit any features, functionality, tools or content of the Services in any form or by any means, or sublicense the rights granted in the Terms, except as expressly permitted herein, without the prior written permission of Total Rehab or the intellectual property owner, as applicable.</p><h3>Feedback</h3><p>Our Users are encouraged to provide feedback through our contact form or otherwise by reaching us by e-mail at the address, <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"mailto:support@total-rehab.co.uk\">support@total-rehab.co.uk</a>. Your feedback can contain suggestions, ideas, comments or improvements to our Services. You acknowledge that all feedback received will be treated as non-confidential and will be the exclusive property of Total Rehab. You hereby irrevocably transfer and assign to Total Rehab all of your right, title, and interest in and to all Feedback, including all worldwide patent, copyright, trade secret, moral and other proprietary or intellectual property rights therein, and waive any moral rights you may have in such Feedback.</p><h3>Third-Party Terms</h3><p>Apps Downloaded from Third Party Stores</p><p>Total Rehab provides an App which can be downloaded and accessed using a third party service provider such as the App Store or the Play Store. You must comply with third party terms, including the End User License Agreement, when downloading, installing, accessing or using the App.</p><p>You agree that these terms are between you and Total Rehab. Your use of either the App Store or Play Store must comply with Terms &amp; Conditions set forth set by the respective third parties. If you fail to download from these third parties, you may contact them in order to resolve the matter. By downloading the App, you also agree that these third party providers do not hold any responsibility for addressing any claims that you might have including product liability claims; any claim that the App Store/Play Store Download fails to conform to any applicable legal or regulatory requirement; and claims arising under consumer protection or similar legislation. As User of Services offered by Total Rehab, you also acknowledge and agree that third party companies and their subsidiaries are third-party beneficiaries of the Terms as related to your license of the App Store/Play Store Download, and that, upon your acceptance of the terms and conditions of the Terms, these third parties will have the right (and will be deemed to have accepted the right) to enforce the Terms as related to your license of the App Store Download against you as a third party beneficiary thereof.</p><p>You must comply with all third party terms &amp; conditions when using the App Store/Play Store Download.</p><h3>Liability</h3><p>We have created rehabilitation plans based on the latest available scientific evidence. But the success and achievement of the associated clinical benefits depend on many factors in the individual users case, which are not in control of Total Rehab. Therefore we cannot be responsible for the success of the rehabilitation.</p><p>Total Rehab is not responsible for damages or deterioration in health caused by a partial or full unavailability of the App. Total Rehab is especially not liable for the success of the rehabilitation plan or a possible deterioration in health if the user has not followed the indications when not to use the App as laid out under section 3.</p><p>Total Rehab is not liable for possible aggravations of the injury or deterioration in health if the user does not follow the detailed exercise and programme instructions in the App or if the deterioration in health is associated to a different health condition of the user than the injury targeted by the rehabilitation plan.</p><p>All claims for compensation shall lapse 2 years after the date of when the user learns of the damage caused. Without considering the user’s knowledge of the event, all claims shall lapse latest 3 years after the date of when the damage occurred. This does not apply for the liability in case of intent or gross negligence or with regard to injuries to life, limb or health.</p><h3>Termination</h3><p>The license is valid until terminated by Total Rehab or by You. Your rights under this license will terminate automatically and without notice from Total Rehab if You fail to adhere to any terms of this license. Upon License termination, You shall stop all use of the Application, and destroy all copies, full or partial of the Application.</p><h3>Applicable law</h3><p>This license agreement is governed by the laws of Germany excluding its conflicts of law rules.</p><h3>Miscellaneous</h3><p>If any of the terms of this agreement should be or become invalid, the validity of the remaining provisions shall not be affected. Invalid provisions will be replaced by valid ones formulated in a way that will achieve the primary purpose.</p><p>Collateral agreements, changes and amendments are only valid if laid down in writing. The preceding clause can only be waived in writing.</p><h3>Changes</h3><p>Total Rehab reserves the right to, at any time, amend this agreement. Users will be informed in a timely manner before the changes come into effect. You are encouraged to review the updated Terms &amp; Conditions to safeguard yourself from any liability that you may face as a direct result of changes being made to this agreement.</p><p>Please note that your continued use of our Services will serve as your acceptance to our updated Terms &amp; Conditions.</p><p>We may also provide updates to our app which would include bug fixes, new plans and/or other things to improve the functionality of the app and provide a better experience to our users. Users are encouraged to keep their App updated either by enabling automatic updates or by manually updating the App in their mobile system to ensure that the App keeps working in the manner intended.</p><h3>Accessing our App</h3><p>Access to the Total Rehab App (the App) is permitted to subscribers during their App subscription period. We reserve the right to suspend, withdraw, discontinue or change all or any part or content of our App without notice. If we withdraw or discontinue subscriptions or the App, we will re-pay you a pro-rata refund of your subscription fees.</p><p>We will not be liable to you if for any reason our App is unavailable at any time or for any period. The App may have a limited amount of free content.</p><h4>How you can sign up to our App subscription service.</h4><p>To access unlimited content on the App you will need to buy our App subscription through Google Play or the Apple App Store. You must be 18 years old or older, have the power to enter into a contract with us, and not be prevented from doing so under any local laws.</p><h4>Where to find the price for your App subscription.</h4><p>The price of the App subscription is indicated in Google Play or the Apple App Store. The price may vary from time to time or by country. We may withdraw any special offers at any time.</p><h4>When you must pay and how you must pay.</h4><p>You must pay for your App subscription via Google Play or the Apple App Store before you can access the App content.</p><p>Renewal Payments: Your app store will debit your debit/credit card at the beginning of your subscription (after the expiry of any free trial) and at the agreed frequency thereafter (unless you have cancelled - see \"Ending Your Subscription\" below).</p><h4>Your App Subscription will automatically renew.</h4><p>At the end of your initial App subscription period, your subscription will automatically renew on a rolling basis for the same period of time as your initial subscription, unless you give your app store notice that you would like to cancel via your account settings (see \"Ending Your Subscription\" below). We reserve the right to change the App subscription price and/or benefits at any time, and the changes will apply when your app subscription renews. If you object to these changes, you may terminate your App subscription within the 30 day period following the renewal.</p><h3>Your App subscription</h3><p>Please read these App Subscription Terms (the Terms) carefully. These Terms tell you how we will provide our app subscription service to you, how you and we may change or end the app subscription contract, what to do if there is a problem and other important information. We may amend these Terms at any time to ensure that we remain compliant with relevant laws and regulations. Please check these Terms regularly for any changes. If we make any important changes to the Terms we will notify you by email.</p><h4>Free Trial and Introductory Offers</h4><p>If you choose to become a subscriber through a trial offer or introductory offer, your trial or introductory offer will cost you the price advertised. Trial or introductory offers are limited to one per customer. At the end of your stated trial or introductory period, your App subscription will automatically continue on a rolling monthly or annual basis (as selected by you when you register) at the rate notified. You may cancel at any time during the free trial or introductory period via your app subscriptions account settings. If you cancel, your access to the App will stop at the end of the trial or introductory period.</p><h4>Access to content</h4><p>Once you have signed up for an App subscription you will immediately be able to access the App content until your App subscription expires or is otherwise terminated by you or us as set out in these Terms.  All content on the is provided in English. Content may only be downloaded or used for personal use.</p><h4>Length of App subscription</h4><p>Your App subscription will start immediately upon payment. Your minimum App subscription period and any renewal period will vary depending on the subscription chosen.  We may suspend your App access if you breach (or we suspect you have breached) these Terms.</p><h4>Ending your subscription</h4><p>To end your App subscription, please access your subscription account settings via your mobile device.  If you cancel within fourteen (14) days of the first payment at the start of your subscription (or any subsequent annual renewal), your app store will refund you in full.  In all other cases, your subscription will continue until your current App subscription term ends and you will not be refunded pro-rata if you cancel before the end of your term. This does not affect your statutory rights.</p><h4>Offers and promotions</h4><p>Offers and prices will vary from time to time and by country.  Promotional offers and incentives are subject to availability and may be changed at any time, subject to applicable laws. Some offers are only available to new customers and subscribers.</p><h3>Contacting customer services</h3><p>Please email <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"mailto:support@total-rehab.co.uk\">support@total-rehab.co.uk</a> for support.</p>"},"__N_SSG":true}