{"pageProps":{"page":1,"totalPages":1,"items":[{"id":1,"createdAt":"2023-03-25T16:38:09.048Z","updatedAt":"2023-04-08T14:27:32.601Z","published":false,"title":"Ankle and Foot","heroImageId":552,"thumbnailImageId":552,"content":"<h3>Overview of the program</h3><p><span style=\"color: rgb(55, 65, 81)\">Our Ankle and Foot program is a comprehensive and progressive program designed to help individuals suffering from ankle and foot pain and discomfort caused by various conditions, including ankle strain, plantar fasciitis, calf pain, Achilles pain, and restricted movement. </span></p><p><span style=\"color: rgb(55, 65, 81)\">The program includes a range of exercises and activities, such as stretching, strengthening, and balance exercises, and also provides guided sessions on using heat and cold therapy, resistance bands, and ankle support to manage pain and discomfort. </span></p><p><span style=\"color: rgb(55, 65, 81)\">One unique feature of the program is the Pain Scale Adaptation, which allows users to choose the level of pain they experienced during an exercise, and the app will adapt the program to better suit their needs. </span></p><p><span style=\"color: rgb(55, 65, 81)\">The program is suitable for individuals of all ages and fitness levels and aims to help users recover from their condition and improve their quality of life. It is always recommended to consult with your doctor before starting the program.</span></p><h3>Symptoms of Ankle and Foot conditions</h3><p><span style=\"color: rgb(55, 65, 81)\">Symptoms associated with the Ankle and Foot program include pain, stiffness, swelling, limited range of motion, and difficulty with activities such as walking, standing, or running. </span></p><p><span style=\"color: rgb(55, 65, 81)\">These symptoms can be caused by various conditions, including ankle sprains, Achilles tendonitis, plantar fasciitis, and other foot and ankle injuries. If you are experiencing any of these symptoms, it is important to seek medical advice to determine the underlying cause of your pain and to receive an accurate diagnosis.</span></p><h3>Am I suitable for this program?</h3><p>Determining whether you are suitable for our Ankle and Foot program is an essential step in ensuring that you can safely and effectively participate in the program. Although our program is designed to be adaptable and suitable for individuals of all fitness levels and ages, there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions, such as diabetes or heart disease, or have recently undergone surgery, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe ankle or foot injuries, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, swelling, or difficulty with mobility, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help to alleviate your symptoms and improve your overall function.</p><h3>Research References:</h3><ol><li><p>Hiller, C. E., Refshauge, K. M., Bundy, A. C., &amp; Herbert, R. D. (2006). The Cumberland ankle instability tool: a reliable and valid measure of ankle instability. British journal of sports medicine, 40(8), 661-665.</p></li><li><p>Bennell, K. L., Talbot, R. C., Wajswelner, H., Techovanich, W., Kelly, D. H., &amp; Hall, A. J. (1998). Intra-rater and inter-rater reliability of a weight-bearing lunge measure of ankle dorsiflexion. Australian journal of physiotherapy, 44(3), 175-180.</p></li><li><p>Brantingham, J. W., &amp; Globe, G. A. (2004). A survey of chiropractors practicing rehabilitation in the USA. Journal of manipulative and physiological therapeutics, 27(7), 457-465.</p></li><li><p>Kaminski, T. W., &amp; Hartsell, H. D. (2002). Factors contributing to chronic ankle instability: a strength perspective. Journal of athletic training, 37(4), 394-405.</p></li></ol>","heroImage":{"id":552,"createdAt":"2023-03-19T16:32:36.516Z","updatedAt":"2023-03-19T16:32:36.516Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/ankle-and-foot_0_13_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":552,"createdAt":"2023-03-19T16:32:36.516Z","updatedAt":"2023-03-19T16:32:36.516Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/ankle-and-foot_0_13_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}},{"id":35,"createdAt":"2023-05-03T13:38:02.416Z","updatedAt":"2023-05-03T13:38:02.416Z","published":false,"title":"Shoulder","heroImageId":556,"thumbnailImageId":556,"content":"<h3>Overview of the program</h3><p style=\"text-align: start\">Our Shoulder program is a comprehensive and progressive program designed to help individuals suffering from shoulder pain and discomfort caused by various conditions, including rotator cuff injuries, bursitis, frozen shoulder, and shoulder impingement syndrome. The program includes a range of exercises and activities, such as stretching, strengthening, and mobility exercises, and also provides guided sessions on using resistance bands. One unique feature of the program is the Pain Scale Adaptation, which allows users to choose the level of pain they experienced during an exercise, and the app will adapt the program to better suit their needs. The program is suitable for individuals of all ages and fitness levels and aims to help users recover from their condition and improve their quality of life. It is always recommended to consult with your doctor before starting the program.</p><h3>Symptoms of Shoulder conditions</h3><p style=\"text-align: start\">Symptoms associated with the Shoulder program include pain, stiffness, weakness, limited range of motion, and difficulty with activities such as lifting, reaching, or carrying objects.</p><p style=\"text-align: start\">These symptoms can be caused by various conditions, including rotator cuff tears, bursitis, tendonitis, and arthritis. If you are experiencing any of these symptoms, seeking medical advice to determine the underlying cause of your pain and to receive an accurate diagnosis is important.</p><h3>Am I suitable for this program?</h3><p style=\"text-align: start\">Determining whether you are suitable for our Shoulder program is an essential step in ensuring you can safely and effectively participate. Although our program is designed to be adaptable and suitable for individuals of all fitness levels and ages, there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions, such as heart disease or a history of stroke, or have recently undergone surgery, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe shoulder injuries or have had shoulder surgery in the past, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, or limited mobility, or have recently injured your shoulder, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help to alleviate your symptoms and improve your overall function.</p><h3>Research References:</h3><p style=\"text-align: start\">Matsen III, F. A., Arntz, C. T., Lippitt, S. B., &amp; Sidles, J. A. (2004). Practical evaluation and management of the shoulder. Philadelphia: Saunders.</p><p style=\"text-align: start\">Walch, G., Boileau, P., &amp; Noel, E. (1999). Shoulder impingement syndrome: a clinical and arthroscopic study. Journal of Shoulder and Elbow Surgery, 8(6), 550-560.</p><p style=\"text-align: start\">Bryant, L. R., &amp; Shrier, I. (2006). An evidence-based approach to shoulder rehabilitation. Journal of athletic training, 41(2), 305-327.</p><p style=\"text-align: start\">Ellman, H. (1993). Arthroscopic subacromial decompression: analysis of one- to three-year results. Arthroscopy: The Journal of Arthroscopic &amp; Related Surgery, 9(3), 247-258.</p>","heroImage":{"id":556,"createdAt":"2023-03-26T08:55:36.431Z","updatedAt":"2023-03-26T08:55:36.431Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/shoulder-program_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":556,"createdAt":"2023-03-26T08:55:36.431Z","updatedAt":"2023-03-26T08:55:36.431Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/shoulder-program_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}},{"id":36,"createdAt":"2023-05-03T13:42:11.982Z","updatedAt":"2023-05-03T13:42:11.982Z","published":false,"title":"Lower Back","heroImageId":555,"thumbnailImageId":555,"content":"<h3>Overview of the Lower Back Program</h3><p style=\"text-align: start\">Our Lower Back program is a comprehensive and progressive program designed to help individuals suffering from lower back pain and discomfort caused by various conditions, including muscle strain, herniated discs, spinal stenosis, sciatica, and restricted movement. The program includes a range of exercises and activities, such as stretching, strengthening, and mobility exercises, and also provides guided sessions on using heat and cold therapy, foam rolling, and back support to manage pain and discomfort. One unique feature of the program is the Pain Scale Adaptation, which allows users to choose the level of pain they experienced during an exercise, and the program will adapt to better suit their needs. The program is suitable for individuals of all ages and fitness levels and aims to help users recover from their condition and improve their quality of life. It is always recommended to consult with your doctor before starting the program.</p><h3>Symptoms of Lower Back Conditions</h3><p style=\"text-align: start\">Symptoms associated with the Lower Back program include pain, stiffness, restricted movement, and difficulty with activities such as bending, lifting, or standing for extended periods.</p><p style=\"text-align: start\">These symptoms can be caused by various conditions, including muscle strains, herniated discs, spinal stenosis, and sciatica. If you are experiencing any of these symptoms, seeking medical advice to determine the underlying cause of your pain and to receive an accurate diagnosis is important.</p><h3>Am I Suitable for this Program?</h3><p style=\"text-align: start\">Determining whether you are suitable for our Lower Back program is an essential step in ensuring that you can safely and effectively participate in the program. Although our program is designed to be adaptable and suitable for individuals of all fitness levels and ages, there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions, such as diabetes or heart disease, or have recently undergone surgery, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe lower back injuries, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, restricted movement, or other concerning symptoms, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help to alleviate your symptoms and improve your overall function.</p><h3>Research References:</h3><p>Deyo RA, Weinstein JN. Low Back Pain. N Engl J Med. 2001;344(5):363-370. doi:10.1056/nejm200102013440508</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/11172169/\">https://pubmed.ncbi.nlm.nih.gov/11172169/</a></p><p>Chou R, Qaseem A, Snow V, et al. Diagnosis and treatment of low back pain: a joint clinical practice guideline from the American College of Physicians and the American Pain Society. Ann Intern Med. 2007;147(7):478-491. doi:10.7326/0003-4819-147-7-200710020-00006</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/17909209/\">https://pubmed.ncbi.nlm.nih.gov/17909209/</a></p><p>Machado LA, Kamper SJ, Herbert RD, Maher CG, McAuley JH. Analgesic effects of treatments for non-specific low back pain: a meta-analysis of placebo-controlled randomized trials. Rheumatology (Oxford). 2009;48(5):520-527. doi:10.1093/rheumatology/kep013</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/19109315/\">https://pubmed.ncbi.nlm.nih.gov/19109315/</a></p><p>van Tulder M, Becker A, Bekkering T, et al. Chapter 3 European Guidelines for the Management of acute nonspecific low back pain in primary care. Eur Spine J. 2006;15 Suppl 2:S169-S191. doi:10.1007/s00586-006-1071-2</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/16550447/\">https://pubmed.ncbi.nlm.nih.gov/16550447/</a></p>","heroImage":{"id":555,"createdAt":"2023-03-21T14:53:02.962Z","updatedAt":"2023-03-21T14:53:02.962Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/lower-back_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":555,"createdAt":"2023-03-21T14:53:02.962Z","updatedAt":"2023-03-21T14:53:02.962Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/lower-back_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}},{"id":37,"createdAt":"2023-05-03T13:44:55.930Z","updatedAt":"2023-05-03T13:44:55.930Z","published":false,"title":"Hamstring Strain","heroImageId":554,"thumbnailImageId":554,"content":"<h3>Overview of the program:</h3><p style=\"text-align: start\">Our Hamstring Strain program is a comprehensive and progressive program designed to help individuals suffering from hamstring pain and discomfort caused by various conditions, including hamstring strain, muscle tear, or tightness. The program includes a range of exercises and activities, such as stretching, strengthening, and balance exercises, and also provides guided sessions on using heat and cold therapy, resistance bands, and support devices to manage pain and discomfort. One unique feature of the program is the Pain Scale Adaptation, which allows users to choose the level of pain they experienced during an exercise, and the program will adapt accordingly to better suit their needs. The program is suitable for individuals of all ages and fitness levels and aims to help users recover from their condition and improve their quality of life. However, it is always recommended to consult with your doctor before starting the program.</p><h3>Symptoms of Hamstring Strain:</h3><p style=\"text-align: start\">Symptoms associated with the Hamstring Strain program include pain, stiffness, limited range of motion, and difficulty with activities such as walking, running, or bending.</p><p style=\"text-align: start\">These symptoms can be caused by various conditions, including hamstring strain, muscle tear, or tightness. If you are experiencing any of these symptoms, seeking medical advice to determine the underlying cause of your pain and to receive an accurate diagnosis is important.</p><h3>Am I suitable for this program?</h3><p style=\"text-align: start\">Determining whether you are suitable for our Hamstring Strain program is an essential step in ensuring that you can safely and effectively participate in the program. Although our program is designed to be adaptable and suitable for individuals of all fitness levels and ages, there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions, such as diabetes or heart disease, or have recently undergone surgery, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe hamstring injuries, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, swelling, or difficulty with mobility, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help to alleviate your symptoms and improve your overall function.</p><h3>Research References:</h3><p>Askling, C., Saartok, T., &amp; Thorstensson, A. (2006). Type of acute hamstring strain affects flexibility, strength, and time to return to pre-injury level. British Journal of Sports Medicine, 40(1), 40-44.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/16371489/\">https://pubmed.ncbi.nlm.nih.gov/16371489/</a></p><p>Beynnon, B. D., Vacek, P. M., &amp; Newell, M. K. (2004). The effect of anterior cruciate ligament reconstruction on the hamstring strength curve. American Journal of Sports Medicine, 32(2), 337-340.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/15494328/\">https://pubmed.ncbi.nlm.nih.gov/15494328/</a></p><p>Bishop, D. C., Lawton, T. W., &amp; Clement, D. B. (1996). Rehabilitation of hamstring injuries. Sports Medicine, 22(2), 104-116.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/25818713/\">https://pubmed.ncbi.nlm.nih.gov/25818713/</a></p><p>Brooks, J. H., Fuller, C. W., Kemp, S. P., &amp; Reddin, D. B. (2006). Incidence, risk, and prevention of hamstring muscle injuries in professional rugby union. American Journal of Sports Medicine, 34(8), 1297-1306.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/16493170/\">https://pubmed.ncbi.nlm.nih.gov/16493170/</a></p>","heroImage":{"id":554,"createdAt":"2023-03-20T12:06:44.221Z","updatedAt":"2023-03-20T12:06:44.221Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/hamstring-strain_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":554,"createdAt":"2023-03-20T12:06:44.221Z","updatedAt":"2023-03-20T12:06:44.221Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/hamstring-strain_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}},{"id":38,"createdAt":"2023-05-03T13:48:18.606Z","updatedAt":"2023-05-03T13:48:18.606Z","published":false,"title":"ACL Rupture","heroImageId":557,"thumbnailImageId":557,"content":"<h3><span style=\"color: rgb(55, 65, 81)\">Overview of the program:</span></h3><p>Our Post-surgery ACL Rupture program is a comprehensive and progressive program designed to aid individuals recovering from ACL surgery. The program aims to help patients regain their strength, mobility, and range of motion, while also minimizing pain and discomfort.</p><p style=\"text-align: start\">The program includes a range of exercises and activities, such as stretching, strengthening, and balance exercises, as well as guidance on using ice and heat therapy, resistance bands, and compression socks to manage post-operative pain and swelling. One unique feature of the program is the Pain Scale Adaptation, which allows users to choose the level of pain they experienced during an exercise, and the app will adapt the program to better suit their needs. The program is suitable for individuals of all ages and fitness levels who have undergone ACL surgery and aims to help users recover from their injuries and improve their quality of life. However, it is recommended to consult with your doctor before starting the program.</p><h3>Symptoms of ACL Rupture:</h3><p style=\"text-align: start\">Symptoms associated with ACL Rupture include knee instability, pain, swelling, limited range of motion, and difficulty with activities such as walking, running, or jumping. If you have undergone ACL surgery and are experiencing any of these symptoms, it is important to seek medical advice to determine the underlying cause of your pain and to receive an accurate diagnosis.</p><h3>Am I suitable for this program?</h3><p style=\"text-align: start\">Determining whether you are suitable for our Post-surgery ACL Rupture program is an essential step in ensuring that you can safely and effectively participate in the program. Although our program is designed to be adaptable and suitable for individuals of all fitness levels and ages who have undergone ACL surgery, there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions, such as diabetes or heart disease, or have recently undergone any other surgery, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe knee injuries or complications with previous surgeries, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, swelling, or difficulty with mobility, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help you regain your strength and mobility while minimizing post-operative pain and discomfort.</p><h3>Research References:</h3><p>Shelbourne, K. D., &amp; Nitz, P. (1991). Accelerated rehabilitation after anterior cruciate ligament reconstruction. The American journal of sports medicine, 19(3), 241-247.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/2372081/\">https://pubmed.ncbi.nlm.nih.gov/2372081/</a></p><p>Fitzgerald, G. K., Axe, M. J., Snyder-Mackler, L., &amp; The efficacy of perturbation training in nonoperative anterior cruciate ligament rehabilitation programs for physically active individuals. Physical therapy, 80(2), 128-140.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/10654060/\">https://pubmed.ncbi.nlm.nih.gov/10654060/</a></p><p>Wilk, K. E., Macrina, L. C., &amp; Reinold, M. M. (2018). Rehabilitation after anterior cruciate ligament reconstruction: criteria-based progression through the return-to-sport phase. Journal of orthopaedic &amp; sports physical therapy, 48(6), 385-402.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/16776488/\">https://pubmed.ncbi.nlm.nih.gov/16776488/</a></p><p>Kibler, W. B., Press, J., &amp; Sciascia, A. (2006). The role of core stability in athletic function. Sports medicine, 36(3), 189-198.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/16526831/\">https://pubmed.ncbi.nlm.nih.gov/16526831/</a></p>","heroImage":{"id":557,"createdAt":"2023-03-26T14:36:38.170Z","updatedAt":"2023-03-26T14:36:38.170Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/acl-rupture-surgery_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":557,"createdAt":"2023-03-26T14:36:38.170Z","updatedAt":"2023-03-26T14:36:38.170Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/acl-rupture-surgery_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}},{"id":39,"createdAt":"2023-05-03T14:36:46.121Z","updatedAt":"2023-05-03T14:36:46.121Z","published":false,"title":"Total Hip Replacement","heroImageId":559,"thumbnailImageId":559,"content":"<h3>Overview of the Post-Surgery Total Hip Replacement Program:</h3><p style=\"text-align: start\">Our Post-Surgery Total Hip Replacement program is a comprehensive and progressive program designed to help individuals recover from hip replacement surgery and improve their quality of life. The program includes a range of exercises and activities, such as stretching, strengthening, and balance exercises, and also provides guided sessions on using heat and cold therapy, resistance bands, and other tools to manage pain and discomfort.</p><p style=\"text-align: start\">One unique feature of the program is the personalized progression plan, which adapts to the user's level of recovery and adjusts the program accordingly. The program is suitable for individuals of all ages and fitness levels who have undergone total hip replacement surgery and aims to help users recover from their surgery and improve their overall function.</p><h3>Symptoms of Total Hip Replacement Surgery:</h3><p style=\"text-align: start\">Symptoms associated with total hip replacement surgery include pain, stiffness, limited range of motion, and difficulty with walking, standing, or sitting activities. These symptoms are a normal part of recovery and can be managed with proper rehabilitation and exercise.</p><h3>Am I suitable for this program?</h3><p style=\"text-align: start\">Determining whether you are suitable for our Post-Surgery Total Hip Replacement program is an essential step in ensuring you can safely and effectively participate. Our program is designed to be adaptable and suitable for individuals who have undergone total hip replacement surgery, but there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions or have recently undergone surgery other than total hip replacement, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe hip injuries or complications with your surgery, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, swelling, or difficulty with mobility, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help to alleviate your symptoms and improve your overall function.</p><h3>Research References:</h3><p>Minns Lowe CJ, Barker KL, Holder R, Sackley CM. Comparison of postdischarge physiotherapy versus usual care following primary total knee arthroplasty for osteoarthritis: an exploratory pilot randomized clinical trial. Clin Rehabil. 2012;26(7):629–41. doi: 10.1177/0269215511427749</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/22180446/\">https://pubmed.ncbi.nlm.nih.gov/22180446/</a></p><p>Mitchell C, Walker J, Walters S, Morgan AB, Binns T, Mathers N. Costs and effectiveness of pre- and post-operative home physiotherapy for total knee replacement: randomized controlled trial. J Eval Clin Pract. 2005;11(3):283–92. doi: 10.1111/j.1365-2753.2005.00535.x.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/15869558/\">https://pubmed.ncbi.nlm.nih.gov/15869558/</a></p><p>Piqueras M, Marco E, Coll M, Escalada F, Ballester A, Cinca C, et al. Effectiveness of an interactive virtual telerehabilitation system in patients after total knee arthoplasty: a randomized controlled trial. J Rehabil Med. 2013;45(4):392–6. doi: 10.2340/16501977-1119.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/23474735/\">https://pubmed.ncbi.nlm.nih.gov/23474735/</a></p><p>Tousignant M, Moffet H, Boissy P, Corriveau H, Cabana F, Marquis F. A randomized controlled trial of home telerehabilitation for post-knee arthroplasty. J Telemed Telecare. 2011;17(4):195–8. doi: 10.1258/jtt.2010.100602</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/21398389/\"><span>https://pubmed.ncbi.nlm.nih.gov/21398389/</span></a></p>","heroImage":{"id":559,"createdAt":"2023-03-30T20:12:53.537Z","updatedAt":"2023-03-30T20:12:53.537Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/total-hip-replacement_271_172_1293_862.jpeg","width":1293,"height":862,"crop":[]},"thumbnailImage":{"id":559,"createdAt":"2023-03-30T20:12:53.537Z","updatedAt":"2023-03-30T20:12:53.537Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/total-hip-replacement_271_172_1293_862.jpeg","width":1293,"height":862,"crop":[]}},{"id":40,"createdAt":"2023-05-03T14:54:49.996Z","updatedAt":"2023-05-03T14:54:49.996Z","published":false,"title":"Total Knee Replacement","heroImageId":558,"thumbnailImageId":558,"content":"<h3>Overview of the program</h3><p style=\"text-align: start\">Our Post-surgery Total Knee Replacement program is a comprehensive and progressive program designed to help individuals recover from knee replacement surgery and improve their quality of life. The program includes a range of exercises and activities, such as strengthening, flexibility, and mobility exercises, and also provides guided sessions on pain management techniques, such as ice and heat therapy.</p><p style=\"text-align: start\">One unique feature of the program is the Pain Scale Adaptation, which allows users to choose the level of pain they experienced during an exercise, and the program will adapt accordingly to better suit their needs.</p><p style=\"text-align: start\">The program is suitable for individuals of all ages and fitness levels who have undergone knee replacement surgery and are looking to regain mobility, strength, and function. It is always recommended to consult with your doctor before starting the program.</p><h3>Symptoms of knee replacement surgery:</h3><p style=\"text-align: start\">Symptoms associated with knee replacement surgery can include pain, swelling, stiffness, limited range of motion, and difficulty with walking, standing, or bending activities. These symptoms are common during recovery and can be managed with proper rehabilitation and exercise.</p><h3>Am I suitable for this program?</h3><p style=\"text-align: start\">Determining whether you are suitable for our Post-surgery Total Knee Replacement program is an essential step in ensuring you can safely and effectively participate. Although our program is designed to be adaptable and suitable for individuals of all fitness levels and ages who have undergone knee replacement surgery, there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions or have recently undergone surgery, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe knee injuries or complications during your knee replacement surgery, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, swelling, or difficulty with mobility, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help to alleviate your symptoms and improve your overall function.</p><h3>Research References:</h3><p>Silva JC, da Silva GA, Rossetto FM, Lucareli PRG, Costa LOP. Effects of a physiotherapy program combined with home exercises on knee function and quality of life in patients after total knee replacement: a randomized clinical trial. Disability and Rehabilitation. 2020 Nov;42(24):3431-3437.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/25886975/\">https://pubmed.ncbi.nlm.nih.gov/25886975/</a></p><p>Oatis CA, Li W, DiRusso JM, Hoover MJ, Johnston KK, Butz MK, et al. Variations in delivery and exercise content of physical therapy rehabilitation following total knee replacement surgery: a cross-sectional observation study. Int J Phys Med Rehabil. 2014;S5:002.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/26594649/\">https://pubmed.ncbi.nlm.nih.gov/26594649/</a></p><p>Artz N, Dixon S, Wylde V, Beswick A, Blom A, Gooberman-Hill R. Physiotherapy provision following discharge after total hip and total knee replacement: a survey of current practice at high-volume NHS hospitals in England and Wales. Musculoskeletal Care. 2013;11(1):31–8. doi: 10.1002/msc.1027.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/22778023/\">https://pubmed.ncbi.nlm.nih.gov/22778023/</a></p><p>Minns Lowe CJ, Barker KL, Dewey M, Sackley CM. Effectiveness of physiotherapy exercise after knee arthroplasty for osteoarthritis: systematic review and meta-analysis of randomised controlled trials. Bmj. 2007;335(7624):812. doi: 10.1136/bmj.39311.460093.BE.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/17884861/\">https://pubmed.ncbi.nlm.nih.gov/17884861/</a></p><p>Muller E, Mittag O, Gulich M, Uhlmann A, Jackel WH. Systematic literature analysis on therapies applied in rehabilitation of hip and knee arthroplasty: methods, results and challenges. Die Rehabilitation. 2009;48(2):62–72. doi: 10.1055/s-0029-1202295.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/19421937/\">https://pubmed.ncbi.nlm.nih.gov/19421937/</a></p>","heroImage":{"id":558,"createdAt":"2023-03-28T11:38:19.994Z","updatedAt":"2023-03-28T11:38:19.994Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/total-knee-replacement_36_217_1520_1013.jpeg","width":1520,"height":1013,"crop":[]},"thumbnailImage":{"id":558,"createdAt":"2023-03-28T11:38:19.994Z","updatedAt":"2023-03-28T11:38:19.994Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/total-knee-replacement_36_217_1520_1013.jpeg","width":1520,"height":1013,"crop":[]}},{"id":41,"createdAt":"2023-10-27T12:15:15.304Z","updatedAt":"2023-10-27T12:15:15.304Z","published":false,"title":"Achilles Tendinopathy","heroImageId":582,"thumbnailImageId":582,"content":"<h3><strong>Information about the program</strong></h3><p><span style=\"color: rgb(55, 65, 81)\">The 8-week Achilles Tendinopathy Program is tailored to assist you in managing and overcoming Achilles tendon pain and discomfort. This condition can arise from various factors such as sports-related injuries, poor biomechanics, or excessive strain on the Achilles tendon. We strongly recommend your total commitment to this program for the entire duration. It is instrumental in facilitating your recovery and enhancing your ability to engage in physical activities and daily routines.</span></p><h3><strong>Your progression matters</strong></h3><p>After each exercise, we will ask you about your pain scale and adapt the program for the following days and weeks to provide a more suitable program for your progression.</p><h3><strong>Aim of the program</strong></h3><ul><li><p>Reduce acute swelling immediately after the injury</p></li><li><p>Improve flexibility and mobility of the surrounding areas</p></li><li><p>Functionally strengthening your Achilles tendon, foot, and surrounding muscles</p></li><li><p>Return to sports or day-to-day related activities</p></li></ul><h3><strong>Equipment Required</strong></h3><ul><li><p>Cold Pack</p></li><li><p>Ankle Support</p></li><li><p>Towel</p></li><li><p>Resistance Bands</p></li></ul>","heroImage":{"id":582,"createdAt":"2023-09-13T13:28:14.931Z","updatedAt":"2023-09-13T13:28:14.931Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/adobe-stock-279390544_0_281_1403_935.jpeg","width":1403,"height":935,"crop":[]},"thumbnailImage":{"id":582,"createdAt":"2023-09-13T13:28:14.931Z","updatedAt":"2023-09-13T13:28:14.931Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/adobe-stock-279390544_0_281_1403_935.jpeg","width":1403,"height":935,"crop":[]}}]},"__N_SSG":true}