{"pageProps":{"blogPost":{"id":39,"createdAt":"2023-05-03T14:36:46.121Z","updatedAt":"2023-05-03T14:36:46.121Z","published":false,"title":"Total Hip Replacement","heroImageId":559,"thumbnailImageId":559,"content":"<h3>Overview of the Post-Surgery Total Hip Replacement Program:</h3><p style=\"text-align: start\">Our Post-Surgery Total Hip Replacement program is a comprehensive and progressive program designed to help individuals recover from hip replacement surgery and improve their quality of life. The program includes a range of exercises and activities, such as stretching, strengthening, and balance exercises, and also provides guided sessions on using heat and cold therapy, resistance bands, and other tools to manage pain and discomfort.</p><p style=\"text-align: start\">One unique feature of the program is the personalized progression plan, which adapts to the user's level of recovery and adjusts the program accordingly. The program is suitable for individuals of all ages and fitness levels who have undergone total hip replacement surgery and aims to help users recover from their surgery and improve their overall function.</p><h3>Symptoms of Total Hip Replacement Surgery:</h3><p style=\"text-align: start\">Symptoms associated with total hip replacement surgery include pain, stiffness, limited range of motion, and difficulty with walking, standing, or sitting activities. These symptoms are a normal part of recovery and can be managed with proper rehabilitation and exercise.</p><h3>Am I suitable for this program?</h3><p style=\"text-align: start\">Determining whether you are suitable for our Post-Surgery Total Hip Replacement program is an essential step in ensuring you can safely and effectively participate. Our program is designed to be adaptable and suitable for individuals who have undergone total hip replacement surgery, but there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions or have recently undergone surgery other than total hip replacement, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe hip injuries or complications with your surgery, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, swelling, or difficulty with mobility, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help to alleviate your symptoms and improve your overall function.</p><h3>Research References:</h3><p>Minns Lowe CJ, Barker KL, Holder R, Sackley CM. Comparison of postdischarge physiotherapy versus usual care following primary total knee arthroplasty for osteoarthritis: an exploratory pilot randomized clinical trial. Clin Rehabil. 2012;26(7):629–41. doi: 10.1177/0269215511427749</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/22180446/\">https://pubmed.ncbi.nlm.nih.gov/22180446/</a></p><p>Mitchell C, Walker J, Walters S, Morgan AB, Binns T, Mathers N. Costs and effectiveness of pre- and post-operative home physiotherapy for total knee replacement: randomized controlled trial. J Eval Clin Pract. 2005;11(3):283–92. doi: 10.1111/j.1365-2753.2005.00535.x.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/15869558/\">https://pubmed.ncbi.nlm.nih.gov/15869558/</a></p><p>Piqueras M, Marco E, Coll M, Escalada F, Ballester A, Cinca C, et al. Effectiveness of an interactive virtual telerehabilitation system in patients after total knee arthoplasty: a randomized controlled trial. J Rehabil Med. 2013;45(4):392–6. doi: 10.2340/16501977-1119.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/23474735/\">https://pubmed.ncbi.nlm.nih.gov/23474735/</a></p><p>Tousignant M, Moffet H, Boissy P, Corriveau H, Cabana F, Marquis F. A randomized controlled trial of home telerehabilitation for post-knee arthroplasty. J Telemed Telecare. 2011;17(4):195–8. doi: 10.1258/jtt.2010.100602</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/21398389/\"><span>https://pubmed.ncbi.nlm.nih.gov/21398389/</span></a></p>","heroImage":{"id":559,"createdAt":"2023-03-30T20:12:53.537Z","updatedAt":"2023-03-30T20:12:53.537Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/total-hip-replacement_271_172_1293_862.jpeg","width":1293,"height":862,"crop":[]},"thumbnailImage":{"id":559,"createdAt":"2023-03-30T20:12:53.537Z","updatedAt":"2023-03-30T20:12:53.537Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/total-hip-replacement_271_172_1293_862.jpeg","width":1293,"height":862,"crop":[]}}},"__N_SSG":true}