{"pageProps":{"blogPost":{"id":1,"createdAt":"2023-03-25T16:38:09.048Z","updatedAt":"2023-04-08T14:27:32.601Z","published":false,"title":"Ankle and Foot","heroImageId":552,"thumbnailImageId":552,"content":"<h3>Overview of the program</h3><p><span style=\"color: rgb(55, 65, 81)\">Our Ankle and Foot program is a comprehensive and progressive program designed to help individuals suffering from ankle and foot pain and discomfort caused by various conditions, including ankle strain, plantar fasciitis, calf pain, Achilles pain, and restricted movement. </span></p><p><span style=\"color: rgb(55, 65, 81)\">The program includes a range of exercises and activities, such as stretching, strengthening, and balance exercises, and also provides guided sessions on using heat and cold therapy, resistance bands, and ankle support to manage pain and discomfort. </span></p><p><span style=\"color: rgb(55, 65, 81)\">One unique feature of the program is the Pain Scale Adaptation, which allows users to choose the level of pain they experienced during an exercise, and the app will adapt the program to better suit their needs. </span></p><p><span style=\"color: rgb(55, 65, 81)\">The program is suitable for individuals of all ages and fitness levels and aims to help users recover from their condition and improve their quality of life. It is always recommended to consult with your doctor before starting the program.</span></p><h3>Symptoms of Ankle and Foot conditions</h3><p><span style=\"color: rgb(55, 65, 81)\">Symptoms associated with the Ankle and Foot program include pain, stiffness, swelling, limited range of motion, and difficulty with activities such as walking, standing, or running. </span></p><p><span style=\"color: rgb(55, 65, 81)\">These symptoms can be caused by various conditions, including ankle sprains, Achilles tendonitis, plantar fasciitis, and other foot and ankle injuries. If you are experiencing any of these symptoms, it is important to seek medical advice to determine the underlying cause of your pain and to receive an accurate diagnosis.</span></p><h3>Am I suitable for this program?</h3><p>Determining whether you are suitable for our Ankle and Foot program is an essential step in ensuring that you can safely and effectively participate in the program. Although our program is designed to be adaptable and suitable for individuals of all fitness levels and ages, there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions, such as diabetes or heart disease, or have recently undergone surgery, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe ankle or foot injuries, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, swelling, or difficulty with mobility, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help to alleviate your symptoms and improve your overall function.</p><h3>Research References:</h3><ol><li><p>Hiller, C. E., Refshauge, K. M., Bundy, A. C., &amp; Herbert, R. D. (2006). The Cumberland ankle instability tool: a reliable and valid measure of ankle instability. British journal of sports medicine, 40(8), 661-665.</p></li><li><p>Bennell, K. L., Talbot, R. C., Wajswelner, H., Techovanich, W., Kelly, D. H., &amp; Hall, A. J. (1998). Intra-rater and inter-rater reliability of a weight-bearing lunge measure of ankle dorsiflexion. Australian journal of physiotherapy, 44(3), 175-180.</p></li><li><p>Brantingham, J. W., &amp; Globe, G. A. (2004). A survey of chiropractors practicing rehabilitation in the USA. Journal of manipulative and physiological therapeutics, 27(7), 457-465.</p></li><li><p>Kaminski, T. W., &amp; Hartsell, H. D. (2002). Factors contributing to chronic ankle instability: a strength perspective. Journal of athletic training, 37(4), 394-405.</p></li></ol>","heroImage":{"id":552,"createdAt":"2023-03-19T16:32:36.516Z","updatedAt":"2023-03-19T16:32:36.516Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/ankle-and-foot_0_13_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":552,"createdAt":"2023-03-19T16:32:36.516Z","updatedAt":"2023-03-19T16:32:36.516Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/ankle-and-foot_0_13_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}}},"__N_SSG":true}