{"pageProps":{"blogPost":{"id":35,"createdAt":"2023-05-03T13:38:02.416Z","updatedAt":"2024-01-08T16:07:53.572Z","published":false,"title":"Rotator Cuff Strain","heroImageId":556,"thumbnailImageId":556,"content":"<h3>Overview of the program</h3><p style=\"text-align: start\">Our Rotator Cuff Strain program is a comprehensive and progressive program designed to help individuals suffering from shoulder pain and discomfort caused by various conditions, including rotator cuff injuries and shoulder impingement syndrome. The program includes a range of exercises and activities, such as stretching, strengthening, and mobility exercises, and also provides guided sessions on using resistance bands. One unique feature of the program is the Pain Scale Adaptation, which allows users to choose the level of pain they experienced during an exercise, and the app will adapt the program to better suit their needs. The program is suitable for individuals of all ages and fitness levels and aims to help users recover from their condition and improve their quality of life. It is always recommended to consult with your doctor before starting the program.</p><h3>Symptoms of Shoulder conditions</h3><p style=\"text-align: start\">Symptoms associated with the Shoulder program include pain, stiffness, weakness, limited range of motion, and difficulty with activities such as lifting, reaching, or carrying objects.</p><p style=\"text-align: start\">These symptoms can be caused by various conditions, including rotator cuff tears, bursitis, tendonitis, and arthritis. If you are experiencing any of these symptoms, seeking medical advice to determine the underlying cause of your pain and to receive an accurate diagnosis is important.</p><h3>Am I suitable for this program?</h3><p style=\"text-align: start\">Determining whether you are suitable for our Shoulder program is an essential step in ensuring you can safely and effectively participate. Although our program is designed to be adaptable and suitable for individuals of all fitness levels and ages, there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions, such as heart disease or a history of stroke, or have recently undergone surgery, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe shoulder injuries or have had shoulder surgery in the past, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, or limited mobility, or have recently injured your shoulder, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help to alleviate your symptoms and improve your overall function.</p><h3>Research References:</h3><p style=\"text-align: start\">Matsen III, F. A., Arntz, C. T., Lippitt, S. B., &amp; Sidles, J. A. (2004). Practical evaluation and management of the shoulder. Philadelphia: Saunders.</p><p style=\"text-align: start\">Walch, G., Boileau, P., &amp; Noel, E. (1999). Shoulder impingement syndrome: a clinical and arthroscopic study. Journal of Shoulder and Elbow Surgery, 8(6), 550-560.</p><p style=\"text-align: start\">Bryant, L. R., &amp; Shrier, I. (2006). An evidence-based approach to shoulder rehabilitation. Journal of athletic training, 41(2), 305-327.</p><p style=\"text-align: start\">Ellman, H. (1993). Arthroscopic subacromial decompression: analysis of one- to three-year results. Arthroscopy: The Journal of Arthroscopic &amp; Related Surgery, 9(3), 247-258.</p>","heroImage":{"id":556,"createdAt":"2023-03-26T08:55:36.431Z","updatedAt":"2023-03-26T08:55:36.431Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/shoulder-program_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":556,"createdAt":"2023-03-26T08:55:36.431Z","updatedAt":"2023-03-26T08:55:36.431Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/shoulder-program_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}}},"__N_SSG":true}