{"pageProps":{"blogPost":{"id":37,"createdAt":"2023-05-03T13:44:55.930Z","updatedAt":"2023-05-03T13:44:55.930Z","published":false,"title":"Hamstring Strain","heroImageId":554,"thumbnailImageId":554,"content":"<h3>Overview of the program:</h3><p style=\"text-align: start\">Our Hamstring Strain program is a comprehensive and progressive program designed to help individuals suffering from hamstring pain and discomfort caused by various conditions, including hamstring strain, muscle tear, or tightness. The program includes a range of exercises and activities, such as stretching, strengthening, and balance exercises, and also provides guided sessions on using heat and cold therapy, resistance bands, and support devices to manage pain and discomfort. One unique feature of the program is the Pain Scale Adaptation, which allows users to choose the level of pain they experienced during an exercise, and the program will adapt accordingly to better suit their needs. The program is suitable for individuals of all ages and fitness levels and aims to help users recover from their condition and improve their quality of life. However, it is always recommended to consult with your doctor before starting the program.</p><h3>Symptoms of Hamstring Strain:</h3><p style=\"text-align: start\">Symptoms associated with the Hamstring Strain program include pain, stiffness, limited range of motion, and difficulty with activities such as walking, running, or bending.</p><p style=\"text-align: start\">These symptoms can be caused by various conditions, including hamstring strain, muscle tear, or tightness. If you are experiencing any of these symptoms, seeking medical advice to determine the underlying cause of your pain and to receive an accurate diagnosis is important.</p><h3>Am I suitable for this program?</h3><p style=\"text-align: start\">Determining whether you are suitable for our Hamstring Strain program is an essential step in ensuring that you can safely and effectively participate in the program. Although our program is designed to be adaptable and suitable for individuals of all fitness levels and ages, there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions, such as diabetes or heart disease, or have recently undergone surgery, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe hamstring injuries, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, swelling, or difficulty with mobility, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help to alleviate your symptoms and improve your overall function.</p><h3>Research References:</h3><p>Askling, C., Saartok, T., &amp; Thorstensson, A. (2006). Type of acute hamstring strain affects flexibility, strength, and time to return to pre-injury level. British Journal of Sports Medicine, 40(1), 40-44.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/16371489/\">https://pubmed.ncbi.nlm.nih.gov/16371489/</a></p><p>Beynnon, B. D., Vacek, P. M., &amp; Newell, M. K. (2004). The effect of anterior cruciate ligament reconstruction on the hamstring strength curve. American Journal of Sports Medicine, 32(2), 337-340.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/15494328/\">https://pubmed.ncbi.nlm.nih.gov/15494328/</a></p><p>Bishop, D. C., Lawton, T. W., &amp; Clement, D. B. (1996). Rehabilitation of hamstring injuries. Sports Medicine, 22(2), 104-116.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/25818713/\">https://pubmed.ncbi.nlm.nih.gov/25818713/</a></p><p>Brooks, J. H., Fuller, C. W., Kemp, S. P., &amp; Reddin, D. B. (2006). Incidence, risk, and prevention of hamstring muscle injuries in professional rugby union. American Journal of Sports Medicine, 34(8), 1297-1306.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/16493170/\">https://pubmed.ncbi.nlm.nih.gov/16493170/</a></p>","heroImage":{"id":554,"createdAt":"2023-03-20T12:06:44.221Z","updatedAt":"2023-03-20T12:06:44.221Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/hamstring-strain_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":554,"createdAt":"2023-03-20T12:06:44.221Z","updatedAt":"2023-03-20T12:06:44.221Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/hamstring-strain_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}}},"__N_SSG":true}