{"pageProps":{"blogPost":{"id":1,"createdAt":"2023-03-25T16:20:19.386Z","updatedAt":"2023-03-25T16:25:54.069Z","published":false,"title":"Learn about P.R.I.C.E protocol","heroImageId":553,"thumbnailImageId":553,"content":"<p><span style=\"color: black\">What you do in the first 24 hours after sustaining an injury or post-surgery is very important. We have provided the following information so you can learn how to effectively use the PRICE protocol to treat swelling and improve the chances of faster recovery.</span></p><h4><span style=\"color: black\">Why PRICE is important?</span></h4><p><span style=\"color: black\">Immediately following an injury, the damaged area may increase in size due to fluid entering the area. This is caused by blood vessels dilating leading to an increase in blood flow into the tissue thus creating redness and swelling. The swelling can be severely painful and may significantly restrict movement of the affected part of the body. An inflammatory response that results from injury generally lasts from a few days to a week. The PRICE protocol helps to control and reduce the swelling to reduce the likelihood of chronic inflammation that can lead to prolonged tissue damage and slower healing.</span></p><h3><span style=\"color: black\">Protect</span></h3><p><span style=\"color: black\">Protecting the site of injury may require you to avoid weight-bearing through the use of crutches. Immobilising the site by using a sling, splint, or brace will also reduce the likelihood of further damage.</span></p><h3><span style=\"color: black\">Rest</span></h3><p><span style=\"color: black\">An important element of the recovery process can be achieved through rest. During this period your body is repairing the injured site. Here, myoblasts and fibroblasts begin to produce collagens and form scar tissue. This is an essential process for muscle healing. If you enter into strenuous exercise too early, the healing process will be delayed.</span></p><h3><span style=\"color: black\">Ice</span></h3><p><span style=\"color: black\">Ice therapy, also known as cryotherapy helps to reduce swelling around the injury site. The constriction of blood vessels slows and prevents further swelling allowing you to begin early active range of motion exercises sooner. Ice can also reduce pain and muscle spasms by decreasing the propagation of the nociceptive neural stimuli to the brain.</span></p><h3><span style=\"color: black\">Compression</span></h3><p><span style=\"color: black\">Compression helps to reduce bleeding at the site of tissue damage, in turn reducing inflammation. It also serves to provide protection for the injured site from excessive movement.</span></p><h3><span style=\"color: black\">Elevation</span></h3><p><span style=\"color: black\">Elevating your injured site by raising your limb allows the build-up of oedema (swelling) to circulate through venous return. This can also facilitate waste removal from the site of injury.</span></p>","heroImage":{"id":553,"createdAt":"2023-03-19T17:24:04.569Z","updatedAt":"2023-03-19T17:24:04.569Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/cold-compress-ankle_0_24_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":553,"createdAt":"2023-03-19T17:24:04.569Z","updatedAt":"2023-03-19T17:24:04.569Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/cold-compress-ankle_0_24_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}}},"__N_SSG":true}