{"pageProps":{"blogPost":{"id":36,"createdAt":"2023-05-03T13:42:11.982Z","updatedAt":"2023-05-03T13:42:11.982Z","published":false,"title":"Lower Back","heroImageId":555,"thumbnailImageId":555,"content":"<h3>Overview of the Lower Back Program</h3><p style=\"text-align: start\">Our Lower Back program is a comprehensive and progressive program designed to help individuals suffering from lower back pain and discomfort caused by various conditions, including muscle strain, herniated discs, spinal stenosis, sciatica, and restricted movement. The program includes a range of exercises and activities, such as stretching, strengthening, and mobility exercises, and also provides guided sessions on using heat and cold therapy, foam rolling, and back support to manage pain and discomfort. One unique feature of the program is the Pain Scale Adaptation, which allows users to choose the level of pain they experienced during an exercise, and the program will adapt to better suit their needs. The program is suitable for individuals of all ages and fitness levels and aims to help users recover from their condition and improve their quality of life. It is always recommended to consult with your doctor before starting the program.</p><h3>Symptoms of Lower Back Conditions</h3><p style=\"text-align: start\">Symptoms associated with the Lower Back program include pain, stiffness, restricted movement, and difficulty with activities such as bending, lifting, or standing for extended periods.</p><p style=\"text-align: start\">These symptoms can be caused by various conditions, including muscle strains, herniated discs, spinal stenosis, and sciatica. If you are experiencing any of these symptoms, seeking medical advice to determine the underlying cause of your pain and to receive an accurate diagnosis is important.</p><h3>Am I Suitable for this Program?</h3><p style=\"text-align: start\">Determining whether you are suitable for our Lower Back program is an essential step in ensuring that you can safely and effectively participate in the program. Although our program is designed to be adaptable and suitable for individuals of all fitness levels and ages, there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions, such as diabetes or heart disease, or have recently undergone surgery, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe lower back injuries, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, restricted movement, or other concerning symptoms, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help to alleviate your symptoms and improve your overall function.</p><h3>Research References:</h3><p>Deyo RA, Weinstein JN. Low Back Pain. N Engl J Med. 2001;344(5):363-370. doi:10.1056/nejm200102013440508</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/11172169/\">https://pubmed.ncbi.nlm.nih.gov/11172169/</a></p><p>Chou R, Qaseem A, Snow V, et al. Diagnosis and treatment of low back pain: a joint clinical practice guideline from the American College of Physicians and the American Pain Society. Ann Intern Med. 2007;147(7):478-491. doi:10.7326/0003-4819-147-7-200710020-00006</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/17909209/\">https://pubmed.ncbi.nlm.nih.gov/17909209/</a></p><p>Machado LA, Kamper SJ, Herbert RD, Maher CG, McAuley JH. Analgesic effects of treatments for non-specific low back pain: a meta-analysis of placebo-controlled randomized trials. Rheumatology (Oxford). 2009;48(5):520-527. doi:10.1093/rheumatology/kep013</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/19109315/\">https://pubmed.ncbi.nlm.nih.gov/19109315/</a></p><p>van Tulder M, Becker A, Bekkering T, et al. Chapter 3 European Guidelines for the Management of acute nonspecific low back pain in primary care. Eur Spine J. 2006;15 Suppl 2:S169-S191. doi:10.1007/s00586-006-1071-2</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/16550447/\">https://pubmed.ncbi.nlm.nih.gov/16550447/</a></p>","heroImage":{"id":555,"createdAt":"2023-03-21T14:53:02.962Z","updatedAt":"2023-03-21T14:53:02.962Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/lower-back_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":555,"createdAt":"2023-03-21T14:53:02.962Z","updatedAt":"2023-03-21T14:53:02.962Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/lower-back_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}}},"__N_SSG":true}