{"pageProps":{"blogPost":{"id":38,"createdAt":"2023-05-03T13:48:18.606Z","updatedAt":"2023-05-03T13:48:18.606Z","published":false,"title":"ACL Rupture","heroImageId":557,"thumbnailImageId":557,"content":"<h3><span style=\"color: rgb(55, 65, 81)\">Overview of the program:</span></h3><p>Our Post-surgery ACL Rupture program is a comprehensive and progressive program designed to aid individuals recovering from ACL surgery. The program aims to help patients regain their strength, mobility, and range of motion, while also minimizing pain and discomfort.</p><p style=\"text-align: start\">The program includes a range of exercises and activities, such as stretching, strengthening, and balance exercises, as well as guidance on using ice and heat therapy, resistance bands, and compression socks to manage post-operative pain and swelling. One unique feature of the program is the Pain Scale Adaptation, which allows users to choose the level of pain they experienced during an exercise, and the app will adapt the program to better suit their needs. The program is suitable for individuals of all ages and fitness levels who have undergone ACL surgery and aims to help users recover from their injuries and improve their quality of life. However, it is recommended to consult with your doctor before starting the program.</p><h3>Symptoms of ACL Rupture:</h3><p style=\"text-align: start\">Symptoms associated with ACL Rupture include knee instability, pain, swelling, limited range of motion, and difficulty with activities such as walking, running, or jumping. If you have undergone ACL surgery and are experiencing any of these symptoms, it is important to seek medical advice to determine the underlying cause of your pain and to receive an accurate diagnosis.</p><h3>Am I suitable for this program?</h3><p style=\"text-align: start\">Determining whether you are suitable for our Post-surgery ACL Rupture program is an essential step in ensuring that you can safely and effectively participate in the program. Although our program is designed to be adaptable and suitable for individuals of all fitness levels and ages who have undergone ACL surgery, there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions, such as diabetes or heart disease, or have recently undergone any other surgery, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe knee injuries or complications with previous surgeries, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, swelling, or difficulty with mobility, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help you regain your strength and mobility while minimizing post-operative pain and discomfort.</p><h3>Research References:</h3><p>Shelbourne, K. D., &amp; Nitz, P. (1991). Accelerated rehabilitation after anterior cruciate ligament reconstruction. The American journal of sports medicine, 19(3), 241-247.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/2372081/\">https://pubmed.ncbi.nlm.nih.gov/2372081/</a></p><p>Fitzgerald, G. K., Axe, M. J., Snyder-Mackler, L., &amp; The efficacy of perturbation training in nonoperative anterior cruciate ligament rehabilitation programs for physically active individuals. Physical therapy, 80(2), 128-140.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/10654060/\">https://pubmed.ncbi.nlm.nih.gov/10654060/</a></p><p>Wilk, K. E., Macrina, L. C., &amp; Reinold, M. M. (2018). Rehabilitation after anterior cruciate ligament reconstruction: criteria-based progression through the return-to-sport phase. Journal of orthopaedic &amp; sports physical therapy, 48(6), 385-402.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/16776488/\">https://pubmed.ncbi.nlm.nih.gov/16776488/</a></p><p>Kibler, W. B., Press, J., &amp; Sciascia, A. (2006). The role of core stability in athletic function. Sports medicine, 36(3), 189-198.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/16526831/\">https://pubmed.ncbi.nlm.nih.gov/16526831/</a></p>","heroImage":{"id":557,"createdAt":"2023-03-26T14:36:38.170Z","updatedAt":"2023-03-26T14:36:38.170Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/acl-rupture-surgery_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":557,"createdAt":"2023-03-26T14:36:38.170Z","updatedAt":"2023-03-26T14:36:38.170Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/acl-rupture-surgery_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}}},"__N_SSG":true}