{"pageProps":{"blogPost":{"id":40,"createdAt":"2023-05-03T14:54:49.996Z","updatedAt":"2023-05-03T14:54:49.996Z","published":false,"title":"Total Knee Replacement","heroImageId":558,"thumbnailImageId":558,"content":"<h3>Overview of the program</h3><p style=\"text-align: start\">Our Post-surgery Total Knee Replacement program is a comprehensive and progressive program designed to help individuals recover from knee replacement surgery and improve their quality of life. The program includes a range of exercises and activities, such as strengthening, flexibility, and mobility exercises, and also provides guided sessions on pain management techniques, such as ice and heat therapy.</p><p style=\"text-align: start\">One unique feature of the program is the Pain Scale Adaptation, which allows users to choose the level of pain they experienced during an exercise, and the program will adapt accordingly to better suit their needs.</p><p style=\"text-align: start\">The program is suitable for individuals of all ages and fitness levels who have undergone knee replacement surgery and are looking to regain mobility, strength, and function. It is always recommended to consult with your doctor before starting the program.</p><h3>Symptoms of knee replacement surgery:</h3><p style=\"text-align: start\">Symptoms associated with knee replacement surgery can include pain, swelling, stiffness, limited range of motion, and difficulty with walking, standing, or bending activities. These symptoms are common during recovery and can be managed with proper rehabilitation and exercise.</p><h3>Am I suitable for this program?</h3><p style=\"text-align: start\">Determining whether you are suitable for our Post-surgery Total Knee Replacement program is an essential step in ensuring you can safely and effectively participate. Although our program is designed to be adaptable and suitable for individuals of all fitness levels and ages who have undergone knee replacement surgery, there are certain factors to consider before beginning the program.</p><p style=\"text-align: start\">If you have any pre-existing medical conditions or have recently undergone surgery, it is crucial to consult with your doctor before starting any new exercise program. Additionally, if you have a history of severe knee injuries or complications during your knee replacement surgery, it is important to seek advice from a medical professional before beginning the program to ensure that it is appropriate for your specific condition.</p><p style=\"text-align: start\">It is also essential to consider the severity of your symptoms before beginning the program. If you are experiencing severe pain, swelling, or difficulty with mobility, it may be necessary to seek medical advice before beginning the program. However, if your symptoms are mild to moderate, our program can help to alleviate your symptoms and improve your overall function.</p><h3>Research References:</h3><p>Silva JC, da Silva GA, Rossetto FM, Lucareli PRG, Costa LOP. Effects of a physiotherapy program combined with home exercises on knee function and quality of life in patients after total knee replacement: a randomized clinical trial. Disability and Rehabilitation. 2020 Nov;42(24):3431-3437.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/25886975/\">https://pubmed.ncbi.nlm.nih.gov/25886975/</a></p><p>Oatis CA, Li W, DiRusso JM, Hoover MJ, Johnston KK, Butz MK, et al. Variations in delivery and exercise content of physical therapy rehabilitation following total knee replacement surgery: a cross-sectional observation study. Int J Phys Med Rehabil. 2014;S5:002.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/26594649/\">https://pubmed.ncbi.nlm.nih.gov/26594649/</a></p><p>Artz N, Dixon S, Wylde V, Beswick A, Blom A, Gooberman-Hill R. Physiotherapy provision following discharge after total hip and total knee replacement: a survey of current practice at high-volume NHS hospitals in England and Wales. Musculoskeletal Care. 2013;11(1):31–8. doi: 10.1002/msc.1027.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/22778023/\">https://pubmed.ncbi.nlm.nih.gov/22778023/</a></p><p>Minns Lowe CJ, Barker KL, Dewey M, Sackley CM. Effectiveness of physiotherapy exercise after knee arthroplasty for osteoarthritis: systematic review and meta-analysis of randomised controlled trials. Bmj. 2007;335(7624):812. doi: 10.1136/bmj.39311.460093.BE.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/17884861/\">https://pubmed.ncbi.nlm.nih.gov/17884861/</a></p><p>Muller E, Mittag O, Gulich M, Uhlmann A, Jackel WH. Systematic literature analysis on therapies applied in rehabilitation of hip and knee arthroplasty: methods, results and challenges. Die Rehabilitation. 2009;48(2):62–72. doi: 10.1055/s-0029-1202295.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://pubmed.ncbi.nlm.nih.gov/19421937/\">https://pubmed.ncbi.nlm.nih.gov/19421937/</a></p>","heroImage":{"id":558,"createdAt":"2023-03-28T11:38:19.994Z","updatedAt":"2023-03-28T11:38:19.994Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/total-knee-replacement_36_217_1520_1013.jpeg","width":1520,"height":1013,"crop":[]},"thumbnailImage":{"id":558,"createdAt":"2023-03-28T11:38:19.994Z","updatedAt":"2023-03-28T11:38:19.994Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/total-knee-replacement_36_217_1520_1013.jpeg","width":1520,"height":1013,"crop":[]}}},"__N_SSG":true}