{"pageProps":{"page":1,"totalPages":1,"items":[{"id":1,"createdAt":"2023-03-25T16:20:19.386Z","updatedAt":"2023-05-03T14:55:07.894Z","published":false,"title":"Learn about P.R.I.C.E protocol","heroImageId":553,"thumbnailImageId":553,"content":"<p><span style=\"color: black\">What you do in the first 24 hours after sustaining an injury or post-surgery is very important. We have provided the following information so you can learn how to effectively use the PRICE protocol to treat swelling and improve the chances of faster recovery.</span></p><h4><span style=\"color: black\">Why PRICE is important?</span></h4><p><span style=\"color: black\">Immediately following an injury, the damaged area may increase in size due to fluid entering the area. This is caused by blood vessels dilating, leading to increased blood flow into the tissue thus creating redness and swelling. The swelling can be severely painful and may significantly restrict movement of the affected part of the body. An inflammatory response that results from injury generally lasts from a few days to a week. The PRICE protocol helps control and reduce the swelling to reduce the likelihood of chronic inflammation, leading to prolonged tissue damage and slower healing.</span></p><h3><span style=\"color: black\">Protect</span></h3><p><span style=\"color: black\">Protecting the site of injury may require you to avoid weight-bearing through the use of crutches. Immobilising the site by using a sling, splint, or brace will also reduce the likelihood of further damage.</span></p><h3><span style=\"color: black\">Rest</span></h3><p><span style=\"color: black\">An important element of the recovery process can be achieved through rest. During this period your body is repairing the injured site. Here, myoblasts and fibroblasts begin to produce collagens and form scar tissue. This is an essential process for muscle healing. If you enter into strenuous exercise too early, the healing process will be delayed.</span></p><h3><span style=\"color: black\">Ice</span></h3><p><span style=\"color: black\">Ice therapy, also known as cryotherapy, helps reduce swelling around the injury site. The constriction of blood vessels slows and prevents further swelling allowing you to begin early active range of motion exercises sooner. Ice can also reduce pain and muscle spasms by decreasing the propagation of the nociceptive neural stimuli to the brain.</span></p><h3><span style=\"color: black\">Compression</span></h3><p><span style=\"color: black\">Compression helps to reduce bleeding at the site of tissue damage, in turn reducing inflammation. It also serves to provide protection for the injured site from excessive movement.</span></p><h3><span style=\"color: black\">Elevation</span></h3><p><span style=\"color: black\">Elevating your injured site by raising your limb allows the build-up of oedema (swelling) to circulate through venous return. This can also facilitate waste removal from the site of injury.</span></p>","heroImage":{"id":553,"createdAt":"2023-03-19T17:24:04.569Z","updatedAt":"2023-03-19T17:24:04.569Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/cold-compress-ankle_0_24_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":553,"createdAt":"2023-03-19T17:24:04.569Z","updatedAt":"2023-03-19T17:24:04.569Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/cold-compress-ankle_0_24_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}},{"id":2,"createdAt":"2023-06-14T13:49:30.314Z","updatedAt":"2023-06-14T14:09:12.064Z","published":false,"title":"Post-Operation Management","heroImageId":560,"thumbnailImageId":560,"content":"<p>Total Rehab Team</p><p>Last Update: 12/06/2023</p><p></p><h3>Introduction.</h3><p>After undergoing surgery, it is crucial to understand the importance of creating a conducive environment that promotes healing and supports your recovery. Your home plays a significant role in this process, offering comfort, safety, and the right conditions for a successful healing journey. This article will delve into the essential aspects of managing your home environment after surgery, providing practical tips and easy-to-follow advice to ensure a smooth and speedy recovery. Let's explore the key factors that can positively impact your healing process from the comfort of your home.</p><h3><strong>Preparing your home environment.</strong></h3><p>Please consider the following:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Remove trip hazards.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ensure floors are clear.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ensure toilet and shower facilities are close by to reduce overexertion.</p><h3><strong>Resuming everyday activities after surgery.</strong></h3><h4>Getting into bed</h4><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; It is easier to lead with the operated leg</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Start by sitting on the edge of the bed</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Slide your bottom back as far as you can with your legs together and bring your legs onto the bed</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; It may be comfortable to place a pillow under your knees when lying on your back</p><h4>Getting out of bed</h4><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; It is easier to lead with your operated leg.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Slide one leg off the bed at a time towards to edge</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Use your hands on the bed to support your body.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Once your feet are on the floor, place both of your walking aids in one hand and push up to stand.</p><h4>Sit to stand from a chair, bed or toilet</h4><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Move your bottom forwards to the edge of the surface.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Place both of your walking aids in one hand and push up to stand.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Having a raised toilet seat helps with lowering yourself and standing up.</p><h4>Stand to sit</h4><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Hold both crutches with one hand</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Stand in front and facing away from the chair</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Use one hand to hold the sitting surface of the chair.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Use the crutches to slowly lower you down to the seat.</p><h4>Ascending stairs</h4><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Place your walking aids in one hand and hold the rail with the other.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Take the first step with your good leg</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Followed by your operated leg</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The walking aid will be last</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You can step up with both legs onto one platform at a time for more comfort</p><h4>Descending stairs</h4><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Place your walking aids in one hand and hold the raise with the other.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The walking aid goes down first</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Step down with your operated leg</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Then step down with your good leg</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You can step down with both legs onto one platform at a time for more comfort</p><h3><strong>Movement Restrictions.</strong></h3><p>For the first six weeks, avoid over-stretching your quadricep muscle if you received an autograph from that area or avoid over-stretching your hamstring if you received an autograph from your hamstring. You should also avoid twisting your knee when your foot is planted, for example, avoid a sudden change of direction when walking.</p><h3><strong>Pain Relief.</strong></h3><p>Once home, you must manage your pain by taking painkillers in a controlled manner as prescribed. This will help you to be more mobile to complete your exercises.</p><h3><strong>Swelling and Bruising.</strong></h3><p>Swelling around your hip or throughout your leg is normal. You can elevate your leg and take anti-inflammatory medication to reduce the swelling and ease discomfort.</p><p><span style=\"color: rgb(32, 33, 36)\">Anticoagulants (blood thinners) may be prescribed for you to avoid deep-vein thrombosis (DVT).</span></p>","heroImage":{"id":560,"createdAt":"2023-03-30T20:46:11.319Z","updatedAt":"2023-03-30T20:46:11.319Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/post-operation-management_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":560,"createdAt":"2023-03-30T20:46:11.319Z","updatedAt":"2023-03-30T20:46:11.319Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/post-operation-management_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}},{"id":3,"createdAt":"2023-06-14T13:57:38.999Z","updatedAt":"2023-06-14T14:09:01.255Z","published":false,"title":"How to Sit with Good Posture: A Step-by-Step Guide","heroImageId":580,"thumbnailImageId":580,"content":"<p>Total Rehab Team</p><p>Last Update: 13/06/2023</p><p></p><h3>Introduction.</h3><p>Picture this: you're sitting at your desk, engrossed in your work, and suddenly you feel a twinge in your back. Your neck starts to ache, and your shoulders feel tense. Sounds familiar? It's time to unlock the secrets of good posture and transform your sitting experience from a pain-inducing marathon to a blissful and productive journey.</p><p style=\"text-align: start\">But why is good sitting posture so crucial? Well, let's dive into the fascinating world of proper alignment and discover the incredible benefits it can bring to your life. Brace yourself for a posture revolution!</p><h3>What's the science?</h3><p style=\"text-align: start\">First and foremost, maintaining good posture ensures that your muscles and joints are in perfect harmony, working together like a well-oiled machine. Imagine a symphony orchestra playing a beautiful melody—each instrument in perfect alignment, creating a harmonious and balanced sound. In a similar way, proper posture aligns your back, neck, and shoulders, preventing the dreaded pain and strain that can plague your daily life.</p><p style=\"text-align: start\">But that's not all. Take a moment to inhale deeply, allowing the air to fill your lungs with ease. Feels refreshing, doesn't it? Well, good posture plays a vital role in improving your breathing too. By sitting upright, you give your lungs the space they need to expand fully, allowing for deeper and more invigorating breaths. Say goodbye to shallow breathing and hello to a revitalized you!</p><p style=\"text-align: start\">Now, let's talk about focus. We've all experienced those moments when our concentration seems to slip away, leaving us feeling frustrated and unproductive. Enter good posture, the superhero of focus. By maintaining proper alignment, you open up the gateway for an increased oxygen flow to your brain. Think of it as giving your mind a breath of fresh air, allowing it to function at its optimal level. So, the next time you need to ace that important task or nail that presentation, remember that good posture is your secret weapon.</p><p style=\"text-align: start\">Imagine walking into a room with an air of confidence, exuding a professional aura that commands respect. Sounds empowering, right? Well, good posture can help you achieve just that. When you sit or stand tall with your head held high and your back straight, you instantly project an image of self-assurance and poise. People notice your confident stance, and it elevates your presence in any situation. So, stand tall, embrace good posture, and let your self-esteem soar.</p><h3>How to sit correctly?</h3><p style=\"text-align: start\">Now that we've uncovered the incredible benefits of good posture, it's time to learn how to sit like a posture pro. Follow these simple steps, and you'll be well on your way to maintaining optimal alignment throughout your day:</p><p style=\"text-align: start\">Step one: Plant your feet firmly on the ground, keeping them flat. This provides a stable foundation for your posture journey.</p><p style=\"text-align: start\">Step two: Relax your shoulders and align them with your hips. Imagine a string gently pulling your spine upwards, creating a straight and graceful posture.</p><p style=\"text-align: start\">Step three: Gently tuck your chin, ensuring that your head stays in line with your spine. Imagine your head as a majestic crown, perfectly balanced atop your regal posture.</p><p style=\"text-align: start\">And here's a bonus tip: When you find yourself sitting for extended periods, make it a habit to take breaks. Stand up, stretch, and move around to keep your body active and your posture refreshed.</p><h3>Conclusion.</h3><p style=\"text-align: start\">So, whether you're a desk warrior, a creative genius, or a dedicated student, remember that good posture is your loyal companion on the journey to health, confidence, and productivity. Embrace the power of alignment, and let it transform the way you sit, the way you work, and ultimately, the way you live. Get ready to unleash your full potential with the magic of good posture!</p>","heroImage":{"id":580,"createdAt":"2023-06-14T13:57:18.815Z","updatedAt":"2023-06-14T13:57:18.815Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/adobe-stock-398223300_0_0_1920_1280.jpeg","width":1920,"height":1280,"crop":[]},"thumbnailImage":{"id":580,"createdAt":"2023-06-14T13:57:18.815Z","updatedAt":"2023-06-14T13:57:18.815Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/adobe-stock-398223300_0_0_1920_1280.jpeg","width":1920,"height":1280,"crop":[]}},{"id":4,"createdAt":"2023-06-14T14:08:49.293Z","updatedAt":"2023-06-14T14:08:49.293Z","published":false,"title":"\"Muscle Knots: Causes and Prevention Simplified\"","heroImageId":581,"thumbnailImageId":581,"content":"<p>Total Rehab Team</p><p>Last Update: 14/06/2023</p><p></p><h3><strong><span style=\"color: black\">Introduction.</span></strong></h3><p><span style=\"color: rgb(55, 65, 81)\">Have you ever experienced those pesky little lumps or knots in your muscles that make you wince in pain when you touch them? Well, my friend, you've encountered the notorious muscle knots, also known as trigger points. These tiny, tight areas of muscle can turn your day into a nightmare, making even the simplest movements a struggle. But fear not! In this article, we will delve into the causes of muscle knots and reveal the secrets to banishing them from your life.</span></p><h3><strong><span style=\"color: rgb(55, 65, 81)\">So, what exactly causes these troublesome muscle knots?</span></strong></h3><p><span style=\"color: rgb(55, 65, 81)\">Picture this: you've been pushing your body to its limits, engaging in intense physical activity without giving it the TLC it deserves. Or perhaps you spend long hours slouched over your desk, neglecting your posture like an old forgotten chair. These behaviours, coupled with injuries to the muscle, are the perfect recipe for muscle knots to take root. Overuse, poor posture, and injuries can create tight, constricted areas in your muscles that feel like hard little lumps, leaving you sore and in pain.</span></p><p><span style=\"color: rgb(55, 65, 81)\">Now, imagine a life where these muscle knots are left untreated. Slowly but surely, they tighten their grip on your body, wreaking havoc on your mobility, causing chronic pain, and even inflicting permanent damage to the surrounding tissues. Imagine struggling to perform simple daily activities or participate in the physical hobbies you once loved. It's not just uncomfortable; it's a direct assault on your quality of life.</span></p><h3><strong><span style=\"color: rgb(55, 65, 81)\">How to eliminate muscle knots?</span></strong></h3><p style=\"text-align: start\"><span style=\"color: rgb(55, 65, 81)\">That's why it's crucial to take charge and manage these muscle knots before they take control. One effective strategy that offers a soothing escape from the clutches of muscle knots is massage therapy. When expertly applied, massage can work wonders by relaxing and loosening the muscles, allowing them to move more freely. The result? Reduced pain and tension, leading to a renewed sense of freedom in your body.</span></p><p style=\"text-align: start\"><span style=\"color: rgb(55, 65, 81)\">But that's not all! Massage also has a profound impact on your body's circulation. Increasing blood flow to the affected areas helps reduce inflammation and swelling, providing relief from the discomfort caused by those stubborn knots. With improved circulation, your muscles can finally catch a break, allowing them to relax and let go of the tension they've been holding onto for dear life.</span></p><p style=\"text-align: start\"><span style=\"color: rgb(55, 65, 81)\">What about those adhesions that cling onto your muscles like glue, causing the knots to form in the first place? Well, massage is here to break them down. With skilful techniques, a massage therapist can target those adhesions, freeing your muscles from their grip and releasing the tension that has been holding you back. Through regular massage sessions, these knots can gradually be reduced, allowing your muscles to function without the nagging pain that has plagued you for far too long.</span></p><h3><strong><span style=\"color: rgb(55, 65, 81)\">What else can I do?</span></strong></h3><p style=\"text-align: start\"><span style=\"color: rgb(55, 65, 81)\">Of course, it's not just massage that can help you bid farewell to muscle knots. Developing good posture habits and incorporating regular stretching into your routine are vital components of knot prevention. By practising proper posture, you can avoid putting unnecessary strain on your muscles, minimizing the risk of knots forming. And don't forget the importance of warming up before any physical activity! A proper warm-up prepares your muscles for action, reducing the likelihood of injury and subsequent knot formation.</span></p><p style=\"text-align: start\"><span style=\"color: rgb(55, 65, 81)\">Remember, your body needs rest too! Give it the care and downtime it deserves. Adequate rest and recovery periods allow your muscles to heal and rejuvenate, preventing the accumulation of tension that can lead to those stubborn knots.</span></p><h3><strong><span style=\"color: rgb(55, 65, 81)\">Conclusion.</span></strong></h3><p style=\"text-align: start\"><span style=\"color: rgb(55, 65, 81)\">So, my friend, the choice is yours. Will you let muscle knots dictate your life, stealing your mobility and causing you endless discomfort? Or will you take the reins and embark on a journey of healing and liberation? With the power of massage, the commitment to good posture and stretching, and the gift of rest, you </span>can break free from the clutches of muscle knots and reclaim a life of pain-free movement and vitality.</p>","heroImage":{"id":581,"createdAt":"2023-06-14T14:08:07.318Z","updatedAt":"2023-06-14T14:08:07.318Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/adobe-stock-252187459_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]},"thumbnailImage":{"id":581,"createdAt":"2023-06-14T14:08:07.318Z","updatedAt":"2023-06-14T14:08:07.318Z","title":"fileName","src":"https://bflvfyeppolxjouqqaxp.supabase.co/storage/v1/object/public/images/public/adobe-stock-252187459_0_0_1824_1216.jpeg","width":1824,"height":1216,"crop":[]}}]},"__N_SSG":true}